app/controllers/books_controller.rb

  def index
    @books = Book.search(params[:search]).order(sort_column + " " + sort_direction)
---
SELECT "books".* FROM "books" ORDER BY description

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("created_at", "description", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 19 Apr 2013 19:15:28 UTC +00:00], ["description", "///"], ["price", 2], ["title", "2"], ["updated_at", Fri, 19 Apr 2013 19:15:28 UTC +00:00]]

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "price" = NULL, "updated_at" = '2013-04-19 19:38:09.433443' WHERE "books"."id" = 1